music_app/app/models/user.rb

SELECT "users".* FROM "users" WHERE (098765) LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    #generate new token
    token = SecureRandom::urlsafe_base64
    #make sure it's unique one other wise generate till its unique
    while User.exists?(session_token: token)

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "098765"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    #user is trying to login.  need to find user based on their input
    #remember we do not have password. and username is unique so we need to find the user based on their userame first
    user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-21 21:07:26.816132"], ["id", 6]]
---
  def reset_session_token!
    self.session_token = generate_unique_session_token
    self.save!